perf/endurance/accounts.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm-up
      duration: 300
      arrivalRate: 10
      rampTo: 50
    - name: Endurance
      duration: 7200
      arrivalRate: 50
    

scenarios:
  - name: Accounts (/accounts)
    flow:
      - get:
          url: '/accounts'